Catalogs/ЗванияГражданскогоВоинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗванияГражданскогоВоинскогоУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщевойсковоеЗвание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассификаторВоинскихЗваний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставыВоеннослужащих</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/КлассификаторВоинскихЗваний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КлассификаторВоинскихЗваний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рядовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Матрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ефрейтор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийМатрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшийСержант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старшина2Статьи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сержант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старшина1Статьи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийСержант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйСтаршина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старшина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйКорабельныйСтаршина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прапорщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мичман</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийПрапорщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийМичман</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшийЛейтенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лейтенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийЛейтенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитанЛейтенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Майор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитан3Ранга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подполковник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитан2Ранга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полковник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитан1Ранга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенералМайор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрАдмирал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенералЛейтенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВицеАдмирал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенералПолковник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адмирал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенералАрмии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдмиралФлота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршалРоссийскойФедерации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗванияГражданскогоВоинскогоУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	
	// 4D:ERP для Беларуси, Петр, 08.11.2017 17:51:13 
	// Редактировать нач. заполнение спр. Воинские звания, №16564
	// {
	ИсключенныеЗвания = новый Массив;
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.КонтрАдмирал);
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.ВицеАдмирал);
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.Адмирал);
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.ГенералАрмии);
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.АдмиралФлота);
	ИсключенныеЗвания.Добавить(Перечисления.КлассификаторВоинскихЗваний.МаршалРоссийскойФедерации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторВоинскихЗваний.Ссылка КАК ОбщевойсковоеЗвание,
		|	ПРЕДСТАВЛЕНИЕ(КлассификаторВоинскихЗваний.Ссылка) КАК Наименование
		|ИЗ
		|	Перечисление.КлассификаторВоинскихЗваний КАК КлассификаторВоинскихЗваний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗванияГражданскогоВоинскогоУчета КАК ЗванияГражданскогоВоинскогоУчета
		|		ПО КлассификаторВоинскихЗваний.Ссылка = ЗванияГражданскогоВоинскогоУчета.ОбщевойсковоеЗвание
		|ГДЕ
		|	ЗванияГражданскогоВоинскогоУчета.Ссылка ЕСТЬ NULL
		| И КлассификаторВоинскихЗваний.Ссылка НЕ В (&ИсключенныеЗвания)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассификаторВоинскихЗваний.Порядок";
		
		Запрос.УстановитьПараметр("ИсключенныеЗвания",ИсключенныеЗвания);	
		
	// }
	// 4D
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеЗванийИСоставов = СоответствиеВоинскихЗванийИСоставов();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СправочникОбъект = Справочники.ЗванияГражданскогоВоинскогоУчета.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			СправочникОбъект.Состав = СоответствиеЗванийИСоставов[Выборка.ОбщевойсковоеЗвание];
			СправочникОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеВоинскихЗванийИСоставов()
	
	Солдаты 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Солдаты, матросы, сержанты, старшины", Истина);
	Прапорщики 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Прапорщики и мичманы", Истина);
	МладшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Младшие офицеры", Истина);
	СтаршиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Старшие офицеры", Истина);
	ВысшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Высшие офицеры", Истина);
	
	СоответствиеЗванийИСоставов = Новый Соответствие;
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Рядовой, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Матрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Ефрейтор, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМатрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина2Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Сержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина1Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйСтаршина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйКорабельныйСтаршина, Солдаты);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Прапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Мичман, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийПрапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМичман, Прапорщики);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Лейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.КапитанЛейтенант, МладшиеОфицеры);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Майор, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан3Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Подполковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан2Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Полковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан1Ранга, СтаршиеОфицеры);
	
	// 4D:ERP для Беларуси, Петр, 08.11.2017 17:36:14 
	// Редактировать нач. заполнение спр. Воинские звания, №16564
	// {
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералМайор, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералЛейтенант, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералПолковник, ВысшиеОфицеры);
	// }
	// 4D
	
	Возврат СоответствиеЗванийИСоставов;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
